{"owner": "ydp", "book": {"isbn": "9780824788834", "description": "", "title": "Fundamentals of Pattern Recognition", "link": "http://www.goodreads.com/book/show/3744640-fundamentals-of-pattern-recognition", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Monique Pavel"], "external_id": {"site": "goodreads", "id": "3744640"}, "published": ""}}
{"owner": "ydp", "book": {"isbn": "9780321426727", "description": "A new edition of this title is available, ISBN-10: 0321553462 ISBN-13: 9780321553461 \"I'm often asked, 'What are the best books about Eclipse?' Number one on my list, every time, is \"Eclipse: Building Commercial-Quality Plug-ins.\" I find it to be the clearest and most relevant book about Eclipse for the real-world software developer. Other Eclipse books focus on the internal Eclipse architecture or on repeating the Eclipse documentation, whereas this book is laser focused on the issues and concepts that matter when you're trying to build a product.\"<br />-- Bjorn Freeman-Benson<br />Director, Open Source Process, Eclipse Foundation \"As the title suggests, this massive tome is intended as a guide to best practices for writing Eclipse plug-ins. I think in that respect it succeeds handily. Before you even think about distributing a plug-in you've written, read this book.\"<br />-- Ernest Friedman-Hill<br />Sheriff, JavaRanch.com\"\"Eclipse: Building Commercial-Quality Plug-ins\" was an invaluable training aid for all of our team members. In fact, training our team without the use of this book as a base would have been virtually impossible. It is now required reading for all our developers and helped us deliver a brand-new, very complex product on time and on budget thanks to the great job this book does of explaining the process of building plug-ins for Eclipse.\"<br />-- Bruce Gruenbaum\"This is easily one of the most useful books I own. If you are new to developing Eclipse plug-ins, it is a 'must-have' that will save you lots of time and effort. You will find lots of good advice in here, especially things that will help add a whole layer of professionalism and completeness to any plug-in. The book is very focused, well-structured, thorough, clearly written, and doesn't contain a single page of 'waffly page filler.' The diagrams explaining the relationships between the different components and manifest sections are excellent and aid in understanding how everything fits together. This book goes well beyond Actions, Views, and Editors, and I think everyone will benefit from the authors' experience. I certainly have.\"<br />-- Tony Saveski\"The authors of this seminal book have decades of proven experience with the most productive and robust software engineering technologies ever developed. Their experiences have now been well applied to the use of Eclipse for more effective Java development. A must-have for any serious software engineering professional!\"<br />-- Ed Klimas\"Just wanted to also let you know this is an excellent book! Thanks for putting forth the effort to create a book that is easy to read and technical at the same time!\"<br />-- Brooke Hedrick\"The key to developing great plug-ins for Eclipse is understanding where and how to extend the IDE, and that's what this book gives you. It is a must for serious plug-in developers, especially those building commercial applications. I wouldn't be without it.\"<br />-- Brian Wilkerson\"If you're looking for just one Eclipse plug-in development book that will be your guide, this is the one. While there are other books available on Eclipse, few dive as deep as \"Eclipse: Building Commercial-Quality Plug-ins.\"\" <br />-- Simon ArcherEclipse has established itself as a dominant force in the application-development space. Key to the success of Eclipse is the ability of developers to extend its functionality using plug-ins.This new edition of \"Eclipse: Building Commercial-Quality Plug-ins\" is the definitive, start-to-finish guide to building commercial-quality Eclipse plug-ins, with an emphasis on adding the sophistication and polish that paying customers demand. The book provides both a quick introduction to using Eclipse for new users and a reference for experienced Eclipse users wishing to expand their knowledge and improve the quality of their Eclipse-based products.Revised to take advantage of pure Eclipse 3.1 and 3.2 APIs, this widely praised bestseller presents detailed, practical coverage of every aspect of plug-in development and specific solutions for the challenges developers are most likely to encounter. All code examples, relevant API listings, diagrams, and screen captures have been updated.Some Eclipse concepts--such as actions, views, and editors--have not changed radically, but now have additional functionality and capabilities. Other areas, such as the Eclipse plug-in infrastructure, have changed drastically due to the Eclipse shift towards an OSGi-based infrastructure. This edition is fully updated to address these new advances for Eclipse developers.<br />Includes a quick introduction to Eclipse for experienced Java programmers<br />Serves as a systematic reference for experienced Eclipse users<br />Introduces all the tools you need to build Eclipse and Rational plug-ins<br />Explains the Eclipse architecture and the structure of plug-ins and extension points<br />Offers practical guidance on building Eclipse user interfaces with SWT and JFace<br />Shows how to use change tracking, perspectives, builders, markers, natures, and more<br />Covers internationalization, help systems, features, and branding<br />This book is designed for anyone who wants a deep understanding of Eclipse, and every experienced developer interested in extending Eclipse or the Rational Software Development Platform. <br />", "title": "Eclipse Building Commercial-Quality Plug-Ins", "link": "http://www.goodreads.com/book/show/547135.Eclipse_Building_Commercial_Quality_Plug_Ins", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Eric Clayberg"], "external_id": {"site": "goodreads", "id": "547135"}, "published": "2006"}}
{"owner": "ydp", "book": {"isbn": "9780471777786", "description": "Written for experienced web developers, Professional Ajax shows how to combine tried-and-true CSS, XML, and JavaScript technologies into Ajax. This provides web developers with the ability to create more sophisticated and responsive user interfaces and break free from the \"click-and-wait\" standard that has dominated the web since its introduction.Professional Ajax discusses the range of request brokers (including the hidden frame technique, iframes, and XMLHttp) and explains when one should be used over another. You will also learn different Ajax techniques and patterns for executing client-server communication on your web site and in web applications. By the end of the book, you will have gained the practical knowledge necessary to implement your own Ajax solutions. In addition to a full chapter case study showing how to combine the book's Ajax techniques into an AjaxMail application, Professional Ajax uses many other examples to build hands-on Ajax experience. Some of the other examples include: web site widgets for a news ticker, weather information, web search, and site searchpreloading pages in online articlesincremental form validationusing Google Web APIs in Ajaxcreating an autosuggest text boxProfessional Ajax readers should be familiar with CSS, XML, JavaScript, and HTML so you can jump right in with the book and begin learning Ajax patterns, XPath and XSLT support in browsers, syndication, web services, JSON, and the Ajax Frameworks, JPSpan, DWR, and Ajax.NET.", "title": "Professional Ajax", "link": "http://www.goodreads.com/book/show/58150.Professional_Ajax", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Nicholas C. Zakas"], "external_id": {"site": "goodreads", "id": "58150"}, "published": "2006"}}
{"owner": "ydp", "book": {"isbn": "9780471200246", "description": "The latest edition of the single most authoritative guide on dimensional modeling for data warehousing!Dimensional modeling has become the most widely accepted approach for data warehouse design. Here is a complete library of dimensional modeling techniques-- the most comprehensive collection ever written. Greatly expanded to cover both basic and advanced techniques for optimizing data warehouse design, this second edition to Ralph Kimball's classic guide is more than sixty percent updated.<br /><br />The authors begin with fundamental design recommendations and gradually progress step-by-step through increasingly complex scenarios. Clear-cut guidelines for designing dimensional models are illustrated using real-world data warehouse case studies drawn from a variety of business application areas and industries, including:<br /><br />* Retail sales and e-commerce<br /><br />* Inventory management<br /><br />* Procurement<br /><br />* Order management<br /><br />* Customer relationship management (CRM)<br /><br />* Human resources management<br /><br />* Accounting<br /><br />* Financial services<br /><br />* Telecommunications and utilities<br /><br />* Education<br /><br />* Transportation<br /><br />* Health care and insurance<br /><br />By the end of the book, you will have mastered the full range of powerful techniques for designing dimensional databases that are easy to understand and provide fast query response. You will also learn how to create an architected framework that integrates the distributed data warehouse using standardized dimensions and facts.<br /><br />This book is also available as part of the Kimball's Data Warehouse Toolkit Classics Box Set (ISBN: 9780470479575) with the following 3 books:<br /><br />The Data Warehouse Toolkit, 2nd Edition (9780471200246)<br /><br />The Data Warehouse Lifecycle Toolkit, 2nd Edition (9780470149775)<br /><br />The Data Warehouse ETL Toolkit (9780764567575)", "title": "The Data Warehouse Toolkit: The Complete Guide to Dimensional Modeling", "link": "http://www.goodreads.com/book/show/748203.The_Data_Warehouse_Toolkit", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Ralph Kimball"], "external_id": {"site": "goodreads", "id": "748203"}, "published": "2002"}}
{"owner": "ydp", "book": {"isbn": "9780122287305", "description": "", "title": "Texturing and Modeling: A Procedural Approach [With *]", "link": "http://www.goodreads.com/book/show/3442457-texturing-and-modeling", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["David S. Ebert"], "external_id": {"site": "goodreads", "id": "3442457"}, "published": ""}}
{"owner": "ydp", "book": {"isbn": "9780201379372", "description": "Raskin (best known as the creator of the Apple Macintosh project) describes flaws in current machine-human interface structures and offers advice on how to fix them. Proceeding from basic facts about how human consciousness interacts with the outside environment, through simple technologies such as radios, to computers, he looks at a number of aspects of interface principles covering keyboards, mouses, screen configuration, and menu bars.", "title": "The Humane Interface: New Directions for Designing Interactive Systems", "link": "http://www.goodreads.com/book/show/344726.The_Humane_Interface", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Jef Raskin"], "external_id": {"site": "goodreads", "id": "344726"}, "published": "2000"}}
{"owner": "ydp", "book": {"isbn": "9780470025963", "description": "The Semantic Web combines the descriptive languages RDF (Resource Description Framework) and OWL (Web Ontology Language), with the data-centric, customizable XML (eXtensible Mark-up Language) to provide descriptions of the content of Web documents. These machine-interpretable descriptions allow more intelligent software systems to be written, automating the analysis and exploitation of web-based information.Software agents will be able to create \"automatically\" new services from already published services, with potentially huge implications for models of e-Business.<br /><br />\"Semantic Web Technologies\" provides a comprehensive overview of key semantic knowledge technologies and research. The authors explain (semi-)automatic ontology generation and metadata extraction in depth, along with ontology management and mediation. Further chapters examine how Semantic Web technology is being applied in knowledge management (\"Semantic Information Access\") and in the next generation of Web services.<br /><br />\"Semantic Web Technologies: \"Provides a comprehensive exposition of the state-of-the art in Semantic Web research and key technologies.Explains the use of ontologies and metadata to achieve machine-interpretability.Describes methods for ontology learning and metadata generation.Discusses ontology management and evolution, covering ontology change detection and propagation, ontology dependency and mediation.Illustrates the theoretical concepts with three case studies on industrial applications in digital libraries, the legal sector and the telecommunication industry.<br /><br />Graduate and advanced undergraduate students, academic and industrial researchers in the field will all find \"Semantic Web Technologies\" an essential guide to the technologies of the Semantic Web.", "title": "Semantic Web Technologies: Trends and Research in Ontology-Based Systems", "link": "http://www.goodreads.com/book/show/788694.Semantic_Web_Technologies", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["John Davies"], "external_id": {"site": "goodreads", "id": "788694"}, "published": "2006"}}
{"owner": "ydp", "book": {"isbn": "9789810222703", "description": "", "title": "Handbook of Character Recognition and Document Image Analysis", "link": "http://www.goodreads.com/book/show/2152286.Handbook_of_Character_Recognition_and_Document_Image_Analysis", "image_url": "http://d202m5krfqbpi5.cloudfront.net/books/1358134228m/2152286.jpg", "authors": ["Patrick S.P. Wang"], "external_id": {"site": "goodreads", "id": "2152286"}, "published": ""}}
{"owner": "ydp", "book": {"isbn": "9783540600985", "description": "Based on a NATO Advanced Study Institute held in 1993, this book addresses recent advances in automatic speech recognition and speech coding. The book contains contributions by many of the most outstanding researchers from the best laboratories worldwide in the field. The contributions have been grouped into five parts: on acoustic modeling; language modeling; speech processing, analysis and synthesis; speech coding; and vector quantization and neural nets. For each of these topics, some of the best-known researchers were invited to give a lecture. In addition to these lectures, the topics were complemented with discussions and presentations of the work of those attending. Altogether, the reader is given a wide perspective on recent advances in the field and will be able to see the trends for future work.", "title": "Speech Recognition and Coding: New Advances and Trends", "link": "http://www.goodreads.com/book/show/372437.Speech_Recognition_and_Coding", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Antonio J. Rubio Ayuso"], "external_id": {"site": "goodreads", "id": "372437"}, "published": "1995"}}
{"owner": "ydp", "book": {"isbn": "9780974514048", "description": "<em>Ship It!</em> is a collection of tips that show the tools and techniques a successful project team has to use, and how to use them well. You'll get quick, easy-to-follow advice on modern practices: which to use, and when they should be applied. This book avoids current fashion trends and marketing hype; instead, readers find page after page of solid advice, all tried and tested in the real world.<br /><br />Aimed at beginning to intermediate programmers, <em>Ship It!</em> will show you:<br /><br /><br />Which tools help, and which don't How to keep a project moving Approaches to scheduling that work How to build developers as well as product What's normal on a project, and what's not How to manage managers, end-users and sponsors Danger signs and how to fix them Few of the ideas presented here are controversial or extreme; most experienced programmers will agree that this stuff works. Yet 50 to 70 percent of all project teams in the U.S. aren't able to use even these simple, well-accepted practices effectively. This book will help you get started.<br /><br /><em>Ship It!</em> begins by introducing the common technical infrastructure that every project needs to get the job done. Readers can choose from a variety of recommended technologies according to their skills and budgets. The next sections outline the necessary steps to get software out the door reliably, using well-accepted, easy-to-adopt, best-of-breed practices that really work.<br /><br />Finally, and most importantly, <em>Ship It!</em> presents common problems that teams face, then offers real-world advice on how to solve them.", "title": "Ship It!: A Practical Guide to Successful Software Projects", "link": "http://www.goodreads.com/book/show/363086.Ship_It_", "image_url": "http://d202m5krfqbpi5.cloudfront.net/books/1328765914m/363086.jpg", "authors": ["Jared Richardson"], "external_id": {"site": "goodreads", "id": "363086"}, "published": "2005"}}
{"owner": "ydp", "book": {"isbn": "9780262240451", "description": "As pop culture, games are as important as film or television--but game design has yet to develop a theoretical framework or critical vocabulary. In Rules of Play Katie Salen and Eric Zimmerman present a much-needed primer for this emerging field. They offer a unified model for looking at all kinds of games, from board games and sports to computer and video games. As active participants in game culture, the authors have written Rules of Play as a catalyst for innovation, filled with new concepts, strategies, and methodologies for creating and understanding games..Building an aesthetics of interactive systems, Salen and Zimmerman define core concepts like \"play,\" \"design,\" and \"interactivity.\" They look at games through a series of eighteen \"game design schemas,\" or conceptual frameworks, including games as systems of emergence and information, as contexts for social play, as a storytelling medium, and as sites of cultural resistance.Written for game scholars, game developers, and interactive designers, Rules of Play is a textbook, reference book, and theoretical guide. It is the first comprehensive attempt to establish a solid theoretical framework for the emerging discipline of game design.", "title": "Rules of Play: Game Design Fundamentals", "link": "http://www.goodreads.com/book/show/176698.Rules_of_Play", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Katie Salen"], "external_id": {"site": "goodreads", "id": "176698"}, "published": "2003"}}
{"owner": "ydp", "book": {"isbn": "9781558609204", "description": "Joe Celko's Trees and Hierarchies in SQL is an intermediate to advanced-level practitioner s guide to mastering the two most challenging aspects of developing database applications in SQL. In this book, Celko illustrates several major approaches to representing trees and hierarchies and related topics that should be of interest to the working database programmer. These topics include hierarchical encoding schemes, graphs, IMS, binary trees, and more. This book covers SQL-92 and SQL:1999. <br />. Includes graph theory and programming techniques.<br />. Running examples throughout the book help illustrate and tie concepts together.<br />. Loads of code, available for download from <a href=\"http://www.mkp.com\" target=\"_blank\" rel=\"nofollow\">www.mkp.com</a>.", "title": "Joe Celko's Trees and Hierarchies in SQL for Smarties", "link": "http://www.goodreads.com/book/show/823784.Joe_Celko_s_Trees_and_Hierarchies_in_SQL_for_Smarties", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Joe Celko"], "external_id": {"site": "goodreads", "id": "823784"}, "published": "2004"}}
{"owner": "ydp", "book": {"isbn": "9780201721492", "description": "-- Improve your Web site step-by-step - and boost customer satisfaction and retention.-- Patterns for e-commerce, internationalization, site-branding, education, and more.<br /><br />-- Optimize home pages, layout, navigation, usability, and performance.<br /><br />Based upon extensive, ground-breaking research, The Design of Sites introduces a comprehensive, pattern-based approach to making web sites truly customer-centered. Using the 101 patterns presented here, Web and business professionals can learn from the industry's experience and best practices, and dramatically improve customer satisfaction and retention. The authors have chronicled visitors' behavior to find the patterns that emerge from experiences ranging from navigation to e-shopping, and to discover how individual site visits fit into users' larger goals of finding information and making purchasing decisions. Drawing on this research, The Design of Sites introduces proven principles, processes, and patterns for building customer-centered Web sites. Their patterns encompass virtually every key issue, including: creating powerful home pages; managing content; simplifying layouts and navigation; optimizing performance, and much more. For all Web designers, developers and decision-makers seeking to maximize the business value of their Web sites.", "title": "The Design of Sites", "link": "http://www.goodreads.com/book/show/1123181.The_Design_of_Sites", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Douglas K. van Duyne"], "external_id": {"site": "goodreads", "id": "1123181"}, "published": "2002"}}
{"owner": "ydp", "book": {"isbn": "9780321334619", "description": "", "title": "Eclipse Rich Client Platform: Designing, Coding, and Packaging Java Applications [With CDROM]", "link": "http://www.goodreads.com/book/show/261464.Eclipse_Rich_Client_Platform", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Jeff McAffer"], "external_id": {"site": "goodreads", "id": "261464"}, "published": ""}}
{"owner": "ydp", "book": {"isbn": "9780201571684", "description": "", "title": "The Unified Modeling Language User Guide", "link": "http://www.goodreads.com/book/show/2085091.The_Unified_Modeling_Language_User_Guide", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Grady Booch"], "external_id": {"site": "goodreads", "id": "2085091"}, "published": ""}}
{"owner": "ydp", "book": {"isbn": "9781852335762", "description": "", "title": "Visualizing the Semantic Web: XML-Based Internet and Information Visualization", "link": "http://www.goodreads.com/book/show/2442729.Visualizing_the_Semantic_Web", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Vladimir Geroimenko"], "external_id": {"site": "goodreads", "id": "2442729"}, "published": ""}}
{"owner": "ydp", "book": {"isbn": "9780321150783", "description": "\"Lean Software Development\" shows software professionals how to achieve breakthrough quality, savings, speed, and business value by adapting the seven \"lean\" principles that have already revolutionized manufacturing and R&amp;D. Drawing on 25+ years' experience leading enterprise projects, the authors show how to use these principles to create agile processes that \"work\" - because they're optimized for your environment.", "title": "Lean Software Development: An Agile Toolkit for Software Development Managers", "link": "http://www.goodreads.com/book/show/194338.Lean_Software_Development", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Mary Poppendieck"], "external_id": {"site": "goodreads", "id": "194338"}, "published": "2003"}}
{"owner": "ydp", "book": {"isbn": "9781932394283", "description": "Lucene is a gem in the open-source worldLucene in Action\" is the authoritative guide to Lucene. It describes how to index your data, including types you definitely need to know such as MS Word, PDF, HTML, and XML. It introduces you to searching, sorting, filtering, and highlighting search results.<br />Lucene powers search in surprising placesWhat's Inside<br />- How to integrate Lucene into your applications<br />- Ready-to-use framework for rich document handling<br />- Case studies including Nutch, TheServerSide, jGuru, etc.<br />- Lucene ports to Perl, Python, C#/.Net, and C++<br />- Sorting, filtering, term vectors, multiple, and remote index searching<br />- The new SpanQuery family, extending query parser, hit collecting<br />- Performance testing and tuning<br />- Lucene add-ons (hit highlighting, synonym lookup, and others)<br />", "title": "Lucene in Action", "link": "http://www.goodreads.com/book/show/1007210.Lucene_in_Action", "image_url": "http://d202m5krfqbpi5.cloudfront.net/books/1328837427m/1007210.jpg", "authors": ["Erik Hatcher"], "external_id": {"site": "goodreads", "id": "1007210"}, "published": "2004"}}
{"owner": "ydp", "book": {"isbn": "9781932394795", "description": "Imagine a publisher who wants to \"stamp\" his ebooks on the fly with the name of the buyer (to discourage sharing). Such a publisher would (and we know one who does) use iText for the task. Developers looking to enhance web- and other applications with dynamic PDF document generation and/or manipulation will find this book unique in content <em>and</em> readability. Based on ongoing examples that encourage learning \"in action,\" they will finally understand PDF and learn how to build applications that produce professional, high-quality PDF documents. While the basic functionality of iText is easy to acquire, <em>iText in Action</em> lowers the learning curve for more advanced functionality. It explains how to use iText to create/manipulate PDF documents on-the-fly in one or more of the following situations:<br /><br /><br /><br />Due to time or size, the PDF documents can't be produced manually The content of the document must be calculated or based on user input. The content needs to be customized or personalized. The PDF content needs to be served in a web environment. Documents are to be created in \"batch process\" mode. All the examples are written in Java, but they can be easily adapted to .NET by developers using one of the .NET ports: iTextSharp (C#) or iText.NET (#J). While iText is a free Java library and the examples are written from the point of view of the Java developer, nine out of ten examples can be run by .NET developers with only minimal changes.<br /><br />Purchase of the print book comes with an offer of a free PDF, ePub, and Kindle eBook from Manning. Also available is all code from the book.", "title": "iText in Action: Creating and Manipulating PDF", "link": "http://www.goodreads.com/book/show/1041100.iText_in_Action", "image_url": "http://d202m5krfqbpi5.cloudfront.net/books/1328694273m/1041100.jpg", "authors": ["Bruno Lowagie"], "external_id": {"site": "goodreads", "id": "1041100"}, "published": "2006"}}
{"owner": "ydp", "book": {"isbn": "9780470084113", "description": "This completely updated volume presents the effective and practical tools you need to design great desktop applications, Web 2.0 sites, and mobile devices. You'll learn the principles of good product behavior and gain an understanding of Cooper's Goal-Directed Design method, which involves everything from conducting user research to defining your product using personas and scenarios. Ultimately, you'll acquire the knowledge to design the best possible digital products and services.", "title": "About Face 3: The Essentials of Interaction Design", "link": "http://www.goodreads.com/book/show/289062.About_Face_3", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Alan Cooper"], "external_id": {"site": "goodreads", "id": "289062"}, "published": "2007"}}
{"owner": "ydp", "book": {"isbn": "9780130151575", "description": "Provides a theoretically sound, technically accurate, and complete description of the basic knowledge and ideas that constitute a modern system for speech recognition by machine. Covers production, perception, and acoustic-phonetic characterization of the speech signal; signal processing and analysis methods for speech recognition; pattern comparison techniques; speech recognition system design and implementation; theory and implementation of hidden Markov models; speech recognition based on connected word models; large vocabulary continuous speech recognition; and task- oriented application of automatic speech recognition. For practicing engineers, scientists, linguists, and programmers interested in speech recognition.", "title": "Fundamentals of Speech Recognition", "link": "http://www.goodreads.com/book/show/1740584.Fundamentals_of_Speech_Recognition", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Lawrence Rabiner"], "external_id": {"site": "goodreads", "id": "1740584"}, "published": "1993"}}
{"owner": "ydp", "book": {"isbn": "9780201325638", "description": "Today, a software designer or architect who seeks to represent the design of a software system can choose from a wide variety of notational languages, each aligned with a particular analysis and design methodology. Ironically, this wide variety of choice is one impediment to the significant benefits promised by software reuse. The emergence of the Unified Modeling Language (UML) -- created by the joint efforts of leading object technologists Grady Booch, Ivar Jacobson, and James Rumbaugh with contributions from many others in the object community -- represents one of the most significant developments in object technology. Supported by a broad base of industry-leading companies, the UML merges the best of the notations used by the three most popular analysis and design methodologies, Booch, OOSE (use-cases), and OMT, to produce a single, universal modeling language that can be used with any method.Written for those already grounded in object-oriented analysis and design, this concise overview introduces you to UML, highlighting the key elements of its notation, semantics, and processes. Included is a brief explanation of UML's history, development, and rationale, as well as discussions on how UML can be integrated into the object-oriented development process. In addition, the book profiles various modeling techniques associated with UML -- use cases, CRC cards, design by contract, dynamic classification, interfaces, and abstract classes -- along with concise descriptions of notation and semantics and numerous insightful tips for effective use based on the authors' experience. In addition, the authors offer the first look at the emerging Objectory Software Development Process derivedfrom the methodologies of Grady Booch, Ivar Jacobson, and James Rumbaugh. To give you a feel for the UML in action, the book includes a Java programming example that outlines the implementation of a UML-based design.<br /><br />You will come away with an excellent understanding of UML essentials, insight into how UML functions within the software development process, and a firm foundation upon which to expand and build your knowledge of the Unified Modeling Language.", "title": "UML Distilled: Applying the Standard Object Modeling Language", "link": "http://www.goodreads.com/book/show/85005.UML_Distilled", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Martin Fowler"], "external_id": {"site": "goodreads", "id": "85005"}, "published": "1997"}}
{"owner": "ydp", "book": {"isbn": "9780321437389", "description": "", "title": "Implementing Lean Software Development: From Concept to Cash", "link": "http://www.goodreads.com/book/show/349417.Implementing_Lean_Software_Development", "image_url": "http://www.goodreads.com/assets/nocover/111x148.png", "authors": ["Mary Poppendieck"], "external_id": {"site": "goodreads", "id": "349417"}, "published": "2006"}}
